ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gls.c
/******************************************************************************
* Function Name: Cy_BLE_GLSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles the Notification Event.
*
*  \param *eventParam: The pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_GLSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_GLS_ApplCallback != NULL))
    {
        cy_stc_ble_gls_char_value_t locCharValue = { .connHandle = eventParam->connHandle };

        if(cy_ble_glsc[discIdx].charInfo[CY_BLE_GLS_GLMT].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_GLS_GLMT;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if(cy_ble_glsc[discIdx].charInfo[CY_BLE_GLS_GLMC].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_GLS_GLMC;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            /* Glucose Service doesn't support any other notifications */
        }

        if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
        {
            locCharValue.value = &eventParam->handleValPair.value;
            Cy_BLE_GLS_ApplCallback((uint32_t)CY_BLE_EVT_GLSC_NOTIFICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_GLSC_IndicationEventHandler
***************************************************************************//**
*
*  Handles the Indication Event.
*
*  \param *eventParam:  the pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_GLSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_GLS_ApplCallback != NULL))
    {
        if(cy_ble_glsc[discIdx].charInfo[CY_BLE_GLS_RACP].valueHandle == eventParam->handleValPair.attrHandle)
        {
            cy_stc_ble_gls_char_value_t locCharValue =
            {
                .charIndex  = CY_BLE_GLS_RACP,
                .connHandle = eventParam->connHandle,
                .value      = &eventParam->handleValPair.value
            };

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_GLS_ApplCallback((uint32_t)CY_BLE_EVT_GLSC_INDICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_GLSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event.
*
*  \param *eventParam: The pointer to the data structure.
*
******************************************************************************/
static void Cy_BLE_GLSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_GLS_ApplCallback != NULL) &&
       (cy_ble_glscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_glsc[discIdx].charInfo[CY_BLE_GLS_GLFT].valueHandle == cy_ble_glscReqHandle[discIdx])
        {
            cy_stc_ble_gls_char_value_t locCharValue =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_GLS_GLFT,
                .value      = &eventParam->value
            };
            cy_ble_glscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_GLS_ApplCallback((uint32_t)CY_BLE_EVT_GLSC_READ_CHAR_RESPONSE, &locCharValue);
        }
        else
        {
            cy_en_ble_gls_char_index_t i;

            for(i = CY_BLE_GLS_GLMT; i < CY_BLE_GLS_CHAR_COUNT; i++)
            {
                if(cy_ble_glsc[discIdx].charInfo[i].cccdHandle == cy_ble_glscReqHandle[discIdx])
                {
                    cy_stc_ble_gls_descr_value_t locDescrValue =
                    {
                        .connHandle = eventParam->connHandle,
                        .charIndex  = i,
                        .descrIndex = CY_BLE_GLS_CCCD,
                        .value      = &eventParam->value
                    };
                    cy_ble_glscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    Cy_BLE_GLS_ApplCallback((uint32_t)CY_BLE_EVT_GLSC_READ_DESCR_RESPONSE, &locDescrValue);
                    break;
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_GLSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles the Write Response Event.
*
*  \param *eventParam: The pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_GLSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_GLS_ApplCallback != NULL) &&
       (cy_ble_glscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_glsc[discIdx].charInfo[CY_BLE_GLS_RACP].valueHandle == cy_ble_glscReqHandle[discIdx])
        {
            cy_stc_ble_gls_char_value_t locCharIndex =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_GLS_RACP,
                .value      = NULL
            };
            cy_ble_glscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_GLS_ApplCallback((uint32_t)CY_BLE_EVT_GLSC_WRITE_CHAR_RESPONSE, &locCharIndex);
        }
        else
        {
            cy_en_ble_gls_char_index_t i;

            for(i = CY_BLE_GLS_GLMT; i < CY_BLE_GLS_CHAR_COUNT; i++)
            {
                if(cy_ble_glsc[discIdx].charInfo[i].cccdHandle == cy_ble_glscReqHandle[discIdx])
                {
                    cy_stc_ble_gls_descr_value_t locDescIndex =
                    {
                        .connHandle = *eventParam,
                        .charIndex  = i,
                        .descrIndex = CY_BLE_GLS_CCCD,
                        .value      = NULL
                    };
                    cy_ble_glscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    Cy_BLE_GLS_ApplCallback((uint32_t)CY_BLE_EVT_GLSC_WRITE_DESCR_RESPONSE, &locDescIndex);
                    break;
                }
            }
        }
    }
}


